Repository: IsraSuper/La-Beaute
Catalog: Make life easier/La_Beate/La_Beate/*.lproj/Localizable.strings
Languages: ar, fr

source: My Skin Care
ar: روتين عنايتي
fr: Mes Soins De La Peau

source: VIT C SERUM
ar: فيتامين سي
fr: SÉRUM VIT C

source: THE ORDINARY
ar: مجموعة ذا اوردينري
fr: L'ORDINAIRE

# ORGINALS GRP
source: RGINALS GRP
ar: مجموعة ذا اوريجنلز
fr: GROUPE ORIGINAUX

source: SUN SCREEN
ar: واقي الشمس
fr: CRÈME SOLAIRE

source: Happy Skin, Happy Day :)
ar: بشرة سعيدة، يوم سعيد :)
fr: Peau heureuse, bonne journée :)

source: Dairy
ar: مذكراتي
fr: Laitière

source: Back
ar: تراجع
fr: Dos

source: Done
ar: تم
fr: Fait

source: I have used this application for 3 days and i feel litterlly my skin breath Israa note: recomend this product to Ohood
ar: لقد استخدمت هذا المنتج لمدة ثلاثة ايام و اشعر ان بشرتي تتنفس حق، ملاحظة اسراء قومي بوص هذا المنتج لعهود
fr: J'utilise cette application depuis 3 jours et je sens que ma peau respire Israa note : recommandez ce produit à Ohood

source: WORTHY
ar: قيم
fr: DIGNE

source: NOT WORTHY
ar: غير قيم
fr: PAS DIGNE

source: My opinion on this product
ar: رأيي عن هذا المنتج
fr: Mon avis sur ce produit

source: Price
ar: السعر
fr: Prix

source: Product Name
ar: اسم المنتج
fr: Nom du produit
